
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если КоэффициентУвеличения = 0 Тогда
		
		КоэффициентУвеличения = 4;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГенерироватьКод(Команда)
	
	Если Не ЗначениеЗаполнено(ТекстКодирования) Тогда
	
		Сообщить("Заполните текст для кодирования");
		Возврат;
	
	КонецЕсли; 
	
	QRКод = ФормированиеQRКода.ЗаполнитьQR(ТекстКодирования, НомерМаски);

	АдресКартинки = ФормированиеМонохромногоBMP.Сформировать(QRКод.Данные, QRКод.Ширина, КоэффициентУвеличения, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры
