Функция БайтыКоррекции(Байты, КоличествоБайтКоррекции) Экспорт

	ПолеГалуа = ПолеГалуа();
	ОбратноеПолеГалуа = ОбратноеПолеГалуа();
	ГенерирующийМногочлен = ОбщегоНазначенияQR.РазделитьСтрокуНаЧисла(ГенерирующийМногочлен(КоличествоБайтКоррекции));
	
	БуферКоррекции = Новый БуферДвоичныхДанных(Макс(КоличествоБайтКоррекции, Байты.Размер));
	БуферКоррекции.Записать(0, Байты);
	
	Для НомерБайта = 1 По Байты.Размер Цикл
	
		ЗначениеТекущегоЭлемента = БуферКоррекции[0];
		
		// Pop
		БуферКоррекции.Записать(0, БуферКоррекции.ПолучитьСрез(1, БуферКоррекции.Размер - 1));
		БуферКоррекции[БуферКоррекции.Размер - 1] = 0;
		
		Если ЗначениеТекущегоЭлемента = 0 Тогда Продолжить КонецЕсли;
		
		ЗначениеКоррекцииПоТекущемуЭлементу = ОбратноеПолеГалуа[ЗначениеТекущегоЭлемента];
		
		Для ИндексКоррекции = 0 По ГенерирующийМногочлен.Количество() - 1 Цикл
			
			ЭлементМногочлена = ГенерирующийМногочлен[ИндексКоррекции];
			НомерЭлементаПоля = ЭлементМногочлена + ЗначениеКоррекцииПоТекущемуЭлементу;
			Если НомерЭлементаПоля > 254 Тогда
				НомерЭлементаПоля = НомерЭлементаПоля % 255;
			КонецЕсли;
			
			ЭлементГалуа = ПолеГалуа[НомерЭлементаПоля];
			
			БуферКоррекции[ИндексКоррекции] = ПобитовоеИсключительноеИли(ЭлементГалуа, БуферКоррекции[ИндексКоррекции]);
		
		КонецЦикла; 
	
	КонецЦикла;
	
	Возврат БуферКоррекции.ПолучитьСрез(0, КоличествоБайтКоррекции);

КонецФункции

Функция ПолеГалуа()
	
	Поле = Новый Массив;
	
	Поле.Добавить(1);
	Поле.Добавить(2);
	Поле.Добавить(4);
	Поле.Добавить(8);
	Поле.Добавить(16);
	Поле.Добавить(32);
	Поле.Добавить(64);
	Поле.Добавить(128);
	Поле.Добавить(29);
	Поле.Добавить(58);
	Поле.Добавить(116);
	Поле.Добавить(232);
	Поле.Добавить(205);
	Поле.Добавить(135);
	Поле.Добавить(19);
	Поле.Добавить(38);
	Поле.Добавить(76);
	Поле.Добавить(152);
	Поле.Добавить(45);
	Поле.Добавить(90);
	Поле.Добавить(180);
	Поле.Добавить(117);
	Поле.Добавить(234);
	Поле.Добавить(201);
	Поле.Добавить(143);
	Поле.Добавить(3);
	Поле.Добавить(6);
	Поле.Добавить(12);
	Поле.Добавить(24);
	Поле.Добавить(48);
	Поле.Добавить(96);
	Поле.Добавить(192);
	Поле.Добавить(157);
	Поле.Добавить(39);
	Поле.Добавить(78);
	Поле.Добавить(156);
	Поле.Добавить(37);
	Поле.Добавить(74);
	Поле.Добавить(148);
	Поле.Добавить(53);
	Поле.Добавить(106);
	Поле.Добавить(212);
	Поле.Добавить(181);
	Поле.Добавить(119);
	Поле.Добавить(238);
	Поле.Добавить(193);
	Поле.Добавить(159);
	Поле.Добавить(35);
	Поле.Добавить(70);
	Поле.Добавить(140);
	Поле.Добавить(5);
	Поле.Добавить(10);
	Поле.Добавить(20);
	Поле.Добавить(40);
	Поле.Добавить(80);
	Поле.Добавить(160);
	Поле.Добавить(93);
	Поле.Добавить(186);
	Поле.Добавить(105);
	Поле.Добавить(210);
	Поле.Добавить(185);
	Поле.Добавить(111);
	Поле.Добавить(222);
	Поле.Добавить(161);
	Поле.Добавить(95);
	Поле.Добавить(190);
	Поле.Добавить(97);
	Поле.Добавить(194);
	Поле.Добавить(153);
	Поле.Добавить(47);
	Поле.Добавить(94);
	Поле.Добавить(188);
	Поле.Добавить(101);
	Поле.Добавить(202);
	Поле.Добавить(137);
	Поле.Добавить(15);
	Поле.Добавить(30);
	Поле.Добавить(60);
	Поле.Добавить(120);
	Поле.Добавить(240);
	Поле.Добавить(253);
	Поле.Добавить(231);
	Поле.Добавить(211);
	Поле.Добавить(187);
	Поле.Добавить(107);
	Поле.Добавить(214);
	Поле.Добавить(177);
	Поле.Добавить(127);
	Поле.Добавить(254);
	Поле.Добавить(225);
	Поле.Добавить(223);
	Поле.Добавить(163);
	Поле.Добавить(91);
	Поле.Добавить(182);
	Поле.Добавить(113);
	Поле.Добавить(226);
	Поле.Добавить(217);
	Поле.Добавить(175);
	Поле.Добавить(67);
	Поле.Добавить(134);
	Поле.Добавить(17);
	Поле.Добавить(34);
	Поле.Добавить(68);
	Поле.Добавить(136);
	Поле.Добавить(13);
	Поле.Добавить(26);
	Поле.Добавить(52);
	Поле.Добавить(104);
	Поле.Добавить(208);
	Поле.Добавить(189);
	Поле.Добавить(103);
	Поле.Добавить(206);
	Поле.Добавить(129);
	Поле.Добавить(31);
	Поле.Добавить(62);
	Поле.Добавить(124);
	Поле.Добавить(248);
	Поле.Добавить(237);
	Поле.Добавить(199);
	Поле.Добавить(147);
	Поле.Добавить(59);
	Поле.Добавить(118);
	Поле.Добавить(236);
	Поле.Добавить(197);
	Поле.Добавить(151);
	Поле.Добавить(51);
	Поле.Добавить(102);
	Поле.Добавить(204);
	Поле.Добавить(133);
	Поле.Добавить(23);
	Поле.Добавить(46);
	Поле.Добавить(92);
	Поле.Добавить(184);
	Поле.Добавить(109);
	Поле.Добавить(218);
	Поле.Добавить(169);
	Поле.Добавить(79);
	Поле.Добавить(158);
	Поле.Добавить(33);
	Поле.Добавить(66);
	Поле.Добавить(132);
	Поле.Добавить(21);
	Поле.Добавить(42);
	Поле.Добавить(84);
	Поле.Добавить(168);
	Поле.Добавить(77);
	Поле.Добавить(154);
	Поле.Добавить(41);
	Поле.Добавить(82);
	Поле.Добавить(164);
	Поле.Добавить(85);
	Поле.Добавить(170);
	Поле.Добавить(73);
	Поле.Добавить(146);
	Поле.Добавить(57);
	Поле.Добавить(114);
	Поле.Добавить(228);
	Поле.Добавить(213);
	Поле.Добавить(183);
	Поле.Добавить(115);
	Поле.Добавить(230);
	Поле.Добавить(209);
	Поле.Добавить(191);
	Поле.Добавить(99);
	Поле.Добавить(198);
	Поле.Добавить(145);
	Поле.Добавить(63);
	Поле.Добавить(126);
	Поле.Добавить(252);
	Поле.Добавить(229);
	Поле.Добавить(215);
	Поле.Добавить(179);
	Поле.Добавить(123);
	Поле.Добавить(246);
	Поле.Добавить(241);
	Поле.Добавить(255);
	Поле.Добавить(227);
	Поле.Добавить(219);
	Поле.Добавить(171);
	Поле.Добавить(75);
	Поле.Добавить(150);
	Поле.Добавить(49);
	Поле.Добавить(98);
	Поле.Добавить(196);
	Поле.Добавить(149);
	Поле.Добавить(55);
	Поле.Добавить(110);
	Поле.Добавить(220);
	Поле.Добавить(165);
	Поле.Добавить(87);
	Поле.Добавить(174);
	Поле.Добавить(65);
	Поле.Добавить(130);
	Поле.Добавить(25);
	Поле.Добавить(50);
	Поле.Добавить(100);
	Поле.Добавить(200);
	Поле.Добавить(141);
	Поле.Добавить(7);
	Поле.Добавить(14);
	Поле.Добавить(28);
	Поле.Добавить(56);
	Поле.Добавить(112);
	Поле.Добавить(224);
	Поле.Добавить(221);
	Поле.Добавить(167);
	Поле.Добавить(83);
	Поле.Добавить(166);
	Поле.Добавить(81);
	Поле.Добавить(162);
	Поле.Добавить(89);
	Поле.Добавить(178);
	Поле.Добавить(121);
	Поле.Добавить(242);
	Поле.Добавить(249);
	Поле.Добавить(239);
	Поле.Добавить(195);
	Поле.Добавить(155);
	Поле.Добавить(43);
	Поле.Добавить(86);
	Поле.Добавить(172);
	Поле.Добавить(69);
	Поле.Добавить(138);
	Поле.Добавить(9);
	Поле.Добавить(18);
	Поле.Добавить(36);
	Поле.Добавить(72);
	Поле.Добавить(144);
	Поле.Добавить(61);
	Поле.Добавить(122);
	Поле.Добавить(244);
	Поле.Добавить(245);
	Поле.Добавить(247);
	Поле.Добавить(243);
	Поле.Добавить(251);
	Поле.Добавить(235);
	Поле.Добавить(203);
	Поле.Добавить(139);
	Поле.Добавить(11);
	Поле.Добавить(22);
	Поле.Добавить(44);
	Поле.Добавить(88);
	Поле.Добавить(176);
	Поле.Добавить(125);
	Поле.Добавить(250);
	Поле.Добавить(233);
	Поле.Добавить(207);
	Поле.Добавить(131);
	Поле.Добавить(27);
	Поле.Добавить(54);
	Поле.Добавить(108);
	Поле.Добавить(216);
	Поле.Добавить(173);
	Поле.Добавить(71);
	Поле.Добавить(142);
	Поле.Добавить(1);
	
	Возврат Поле;
	
КонецФункции

Функция ОбратноеПолеГалуа()
	
	Поле = Новый Массив;
	
	Поле.Добавить(0);
	Поле.Добавить(0);
	Поле.Добавить(1);
	Поле.Добавить(25);
	Поле.Добавить(2);
	Поле.Добавить(50);
	Поле.Добавить(26);
	Поле.Добавить(198);
	Поле.Добавить(3);
	Поле.Добавить(223);
	Поле.Добавить(51);
	Поле.Добавить(238);
	Поле.Добавить(27);
	Поле.Добавить(104);
	Поле.Добавить(199);
	Поле.Добавить(75);
	Поле.Добавить(4);
	Поле.Добавить(100);
	Поле.Добавить(224);
	Поле.Добавить(14);
	Поле.Добавить(52);
	Поле.Добавить(141);
	Поле.Добавить(239);
	Поле.Добавить(129);
	Поле.Добавить(28);
	Поле.Добавить(193);
	Поле.Добавить(105);
	Поле.Добавить(248);
	Поле.Добавить(200);
	Поле.Добавить(8);
	Поле.Добавить(76);
	Поле.Добавить(113);
	Поле.Добавить(5);
	Поле.Добавить(138);
	Поле.Добавить(101);
	Поле.Добавить(47);
	Поле.Добавить(225);
	Поле.Добавить(36);
	Поле.Добавить(15);
	Поле.Добавить(33);
	Поле.Добавить(53);
	Поле.Добавить(147);
	Поле.Добавить(142);
	Поле.Добавить(218);
	Поле.Добавить(240);
	Поле.Добавить(18);
	Поле.Добавить(130);
	Поле.Добавить(69);
	Поле.Добавить(29);
	Поле.Добавить(181);
	Поле.Добавить(194);
	Поле.Добавить(125);
	Поле.Добавить(106);
	Поле.Добавить(39);
	Поле.Добавить(249);
	Поле.Добавить(185);
	Поле.Добавить(201);
	Поле.Добавить(154);
	Поле.Добавить(9);
	Поле.Добавить(120);
	Поле.Добавить(77);
	Поле.Добавить(228);
	Поле.Добавить(114);
	Поле.Добавить(166);
	Поле.Добавить(6);
	Поле.Добавить(191);
	Поле.Добавить(139);
	Поле.Добавить(98);
	Поле.Добавить(102);
	Поле.Добавить(221);
	Поле.Добавить(48);
	Поле.Добавить(253);
	Поле.Добавить(226);
	Поле.Добавить(152);
	Поле.Добавить(37);
	Поле.Добавить(179);
	Поле.Добавить(16);
	Поле.Добавить(145);
	Поле.Добавить(34);
	Поле.Добавить(136);
	Поле.Добавить(54);
	Поле.Добавить(208);
	Поле.Добавить(148);
	Поле.Добавить(206);
	Поле.Добавить(143);
	Поле.Добавить(150);
	Поле.Добавить(219);
	Поле.Добавить(189);
	Поле.Добавить(241);
	Поле.Добавить(210);
	Поле.Добавить(19);
	Поле.Добавить(92);
	Поле.Добавить(131);
	Поле.Добавить(56);
	Поле.Добавить(70);
	Поле.Добавить(64);
	Поле.Добавить(30);
	Поле.Добавить(66);
	Поле.Добавить(182);
	Поле.Добавить(163);
	Поле.Добавить(195);
	Поле.Добавить(72);
	Поле.Добавить(126);
	Поле.Добавить(110);
	Поле.Добавить(107);
	Поле.Добавить(58);
	Поле.Добавить(40);
	Поле.Добавить(84);
	Поле.Добавить(250);
	Поле.Добавить(133);
	Поле.Добавить(186);
	Поле.Добавить(61);
	Поле.Добавить(202);
	Поле.Добавить(94);
	Поле.Добавить(155);
	Поле.Добавить(159);
	Поле.Добавить(10);
	Поле.Добавить(21);
	Поле.Добавить(121);
	Поле.Добавить(43);
	Поле.Добавить(78);
	Поле.Добавить(212);
	Поле.Добавить(229);
	Поле.Добавить(172);
	Поле.Добавить(115);
	Поле.Добавить(243);
	Поле.Добавить(167);
	Поле.Добавить(87);
	Поле.Добавить(7);
	Поле.Добавить(112);
	Поле.Добавить(192);
	Поле.Добавить(247);
	Поле.Добавить(140);
	Поле.Добавить(128);
	Поле.Добавить(99);
	Поле.Добавить(13);
	Поле.Добавить(103);
	Поле.Добавить(74);
	Поле.Добавить(222);
	Поле.Добавить(237);
	Поле.Добавить(49);
	Поле.Добавить(197);
	Поле.Добавить(254);
	Поле.Добавить(24);
	Поле.Добавить(227);
	Поле.Добавить(165);
	Поле.Добавить(153);
	Поле.Добавить(119);
	Поле.Добавить(38);
	Поле.Добавить(184);
	Поле.Добавить(180);
	Поле.Добавить(124);
	Поле.Добавить(17);
	Поле.Добавить(68);
	Поле.Добавить(146);
	Поле.Добавить(217);
	Поле.Добавить(35);
	Поле.Добавить(32);
	Поле.Добавить(137);
	Поле.Добавить(46);
	Поле.Добавить(55);
	Поле.Добавить(63);
	Поле.Добавить(209);
	Поле.Добавить(91);
	Поле.Добавить(149);
	Поле.Добавить(188);
	Поле.Добавить(207);
	Поле.Добавить(205);
	Поле.Добавить(144);
	Поле.Добавить(135);
	Поле.Добавить(151);
	Поле.Добавить(178);
	Поле.Добавить(220);
	Поле.Добавить(252);
	Поле.Добавить(190);
	Поле.Добавить(97);
	Поле.Добавить(242);
	Поле.Добавить(86);
	Поле.Добавить(211);
	Поле.Добавить(171);
	Поле.Добавить(20);
	Поле.Добавить(42);
	Поле.Добавить(93);
	Поле.Добавить(158);
	Поле.Добавить(132);
	Поле.Добавить(60);
	Поле.Добавить(57);
	Поле.Добавить(83);
	Поле.Добавить(71);
	Поле.Добавить(109);
	Поле.Добавить(65);
	Поле.Добавить(162);
	Поле.Добавить(31);
	Поле.Добавить(45);
	Поле.Добавить(67);
	Поле.Добавить(216);
	Поле.Добавить(183);
	Поле.Добавить(123);
	Поле.Добавить(164);
	Поле.Добавить(118);
	Поле.Добавить(196);
	Поле.Добавить(23);
	Поле.Добавить(73);
	Поле.Добавить(236);
	Поле.Добавить(127);
	Поле.Добавить(12);
	Поле.Добавить(111);
	Поле.Добавить(246);
	Поле.Добавить(108);
	Поле.Добавить(161);
	Поле.Добавить(59);
	Поле.Добавить(82);
	Поле.Добавить(41);
	Поле.Добавить(157);
	Поле.Добавить(85);
	Поле.Добавить(170);
	Поле.Добавить(251);
	Поле.Добавить(96);
	Поле.Добавить(134);
	Поле.Добавить(177);
	Поле.Добавить(187);
	Поле.Добавить(204);
	Поле.Добавить(62);
	Поле.Добавить(90);
	Поле.Добавить(203);
	Поле.Добавить(89);
	Поле.Добавить(95);
	Поле.Добавить(176);
	Поле.Добавить(156);
	Поле.Добавить(169);
	Поле.Добавить(160);
	Поле.Добавить(81);
	Поле.Добавить(11);
	Поле.Добавить(245);
	Поле.Добавить(22);
	Поле.Добавить(235);
	Поле.Добавить(122);
	Поле.Добавить(117);
	Поле.Добавить(44);
	Поле.Добавить(215);
	Поле.Добавить(79);
	Поле.Добавить(174);
	Поле.Добавить(213);
	Поле.Добавить(233);
	Поле.Добавить(230);
	Поле.Добавить(231);
	Поле.Добавить(173);
	Поле.Добавить(232);
	Поле.Добавить(116);
	Поле.Добавить(214);
	Поле.Добавить(244);
	Поле.Добавить(234);
	Поле.Добавить(168);
	Поле.Добавить(80);
	Поле.Добавить(88);
	Поле.Добавить(175);
	
	Возврат Поле;
	
КонецФункции

Функция ГенерирующийМногочлен(КоличествоБайтКоррекции)

	Если КоличествоБайтКоррекции = 7 Тогда
	
		Возврат "87, 229, 146, 149, 238, 102, 21";
		
	ИначеЕсли КоличествоБайтКоррекции = 10 Тогда
	
		Возврат "251, 67, 46, 61, 118, 70, 64, 94, 32, 45";
	
	ИначеЕсли КоличествоБайтКоррекции = 13 Тогда
	
		Возврат "74, 152, 176, 100, 86, 100, 106, 104, 130, 218, 206, 140, 78";
	
	ИначеЕсли КоличествоБайтКоррекции = 15 Тогда
	
		Возврат "8, 183, 61, 91, 202, 37, 51, 58, 58, 237, 140, 124, 5, 99, 105";
	
	ИначеЕсли КоличествоБайтКоррекции = 16 Тогда
	
		Возврат "120, 104, 107, 109, 102, 161, 76, 3, 91, 191, 147, 169, 182, 194, 225, 120";
	
	ИначеЕсли КоличествоБайтКоррекции = 17 Тогда
	
		Возврат "43, 139, 206, 78, 43, 239, 123, 206, 214, 147, 24, 99, 150, 39, 243, 163, 136";
	
	ИначеЕсли КоличествоБайтКоррекции = 18 Тогда
	
		Возврат "215, 234, 158, 94, 184, 97, 118, 170, 79, 187, 152, 148, 252, 179, 5, 98, 96, 153";
	
	ИначеЕсли КоличествоБайтКоррекции = 20 Тогда
	
		Возврат "17, 60, 79, 50, 61, 163, 26, 187, 202, 180, 221, 225, 83, 239, 156, 164, 212, 212, 188, 190";
	
	ИначеЕсли КоличествоБайтКоррекции = 22 Тогда
	
		Возврат "210, 171, 247, 242, 93, 230, 14, 109, 221, 53, 200, 74, 8, 172, 98, 80, 219, 134, 160, 105, 165, 231";
	
	ИначеЕсли КоличествоБайтКоррекции = 24 Тогда
	
		Возврат "229, 121, 135, 48, 211, 117, 251, 126, 159, 180, 169, 152, 192, 226, 228, 218, 111, 0, 117, 232, 87, 96, 227, 21";
	
	ИначеЕсли КоличествоБайтКоррекции = 26 Тогда
	
		Возврат "173, 125, 158, 2, 103, 182, 118, 17, 145, 201, 111, 28, 165, 53, 161, 21, 245, 142, 13, 102, 48, 227, 153, 145, 218, 70";
	
	ИначеЕсли КоличествоБайтКоррекции = 28 Тогда
	
		Возврат "168, 223, 200, 104, 224, 234, 108, 180, 110, 190, 195, 147, 205, 27, 232, 201, 21, 43, 245, 87, 42, 195, 212, 119, 242, 37, 9, 123";
	
	ИначеЕсли КоличествоБайтКоррекции = 30 Тогда
	
		Возврат "41, 173, 145, 152, 216, 31, 179, 182, 50, 48, 110, 86, 239, 96, 222, 125, 42, 173, 226, 193, 224, 130, 156, 37, 251, 216, 238, 40, 192, 180";
	
	Иначе
		
		ВызватьИсключение "Невозможно определить генерирующий многочлен";
	
	КонецЕсли; 

КонецФункции
